In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
ser1 = Series([2, np.nan, 4, np.nan, 6, np.nan], 
                    index = ['Q','R','S','T','U','V'])

ser1

Q    2.0
R    NaN
S    4.0
T    NaN
U    6.0
V    NaN
dtype: float64

In [5]:
ser2 = Series(np.arange(len(ser1)),dtype=np.float64,
                index = ['Q','R','S','T','U','V'])
ser2

Q    0.0
R    1.0
S    2.0
T    3.0
U    4.0
V    5.0
dtype: float64

In [6]:
#where value of series 2 is chosen when the value of series 1 is null 
# in numpy where pandas is null for ser1, chose ser2 or ser1, for the index of ser1
Series(np.where(pd.isnull(ser1),ser2,ser1),index=ser1.index)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [7]:
#shortcut to do the where function/method
ser1.combine_first(ser2)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [12]:
#on dataframes
npn = np.nan
dFrame_odds = DataFrame({'X':[1.,npn,3.,npn],
                        'Y':[npn,5.,npn,7.],
                        'Z':[npn,9.,npn,11.]})

In [13]:
dFrame_evens = DataFrame({'X':[2.,4.,npn,6.,7.],
                        'Y':[npn,10.,12.,14.,16.]})

In [14]:
dFrame_odds

     X    Y     Z
0  1.0  NaN   NaN
1  NaN  5.0   9.0
2  3.0  NaN   NaN
3  NaN  7.0  11.0

In [15]:
dFrame_evens

     X     Y
0  2.0   NaN
1  4.0  10.0
2  NaN  12.0
3  6.0  14.0
4  7.0  16.0

In [16]:
dFrame_odds.combine_first(dFrame_evens)

     X     Y     Z
0  1.0   NaN   NaN
1  4.0   5.0   9.0
2  3.0  12.0   NaN
3  6.0   7.0  11.0
4  7.0  16.0   NaN